In [1]:
import pandas as pd
import numpy as np

In [13]:
np.random.seed(7)
s1 = pd.Series(np.random.randint(1, high=5, size=100))
s2 = pd.Series(np.random.randint(1, high=4, size=100))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100))

In [14]:
s = pd.concat([s1,s2,s3], axis=1)
s.head()

   0  1      2
0  4  3  16871
1  1  3  21231
2  2  3  14141
3  3  2  24248
4  4  3  22763

In [16]:
s.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
s.head()

   bedrs  bathrs  price_sqr_meter
0      4       3            16871
1      1       3            21231
2      2       3            14141
3      3       2            24248
4      4       3            22763

In [22]:
bigcolumn = pd.concat([s1, s2, s3]).to_frame()

In [25]:
bigcolumn.reset_index(drop=True, inplace=True)